# BRepBuilderSurfaceGeometry Properties

---
The BRepBuilderSurfaceGeometry type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
BRepBuilderSurfaceGeometry Class
Autodesk.Revit.DB Namespace